Revit 2027 API
BuiltInFailures.StairRampFailures.ContinuousRailNotContinuous Property
 The rail is non-continuous.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContinuousRailNotContinuous { get; }
Public Shared ReadOnly Property ContinuousRailNotContinuous As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContinuousRailNotContinuous {
	FailureDefinitionId^ get ();
}
static member ContinuousRailNotContinuous : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace